# FailuresAccessor Properties

---
The FailuresAccessor type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
#### Reference
FailuresAccessor Class
Autodesk.Revit.DB Namespace